export default {
  projections: {
    РегРезультE: {
      датРегРезСобес: {
        __caption__: 'Дата регистрации результатов'
      },
      организация: {
        __caption__: 'Наименование организации',
        наименование: {
          __caption__: 'Наименование организации'
        }
      },
      планирСобес: {
        __caption__: 'ФИО',
        регистАнкеты: {
          __caption__: '',
          фИОКандидата: {
            __caption__: 'ФИО'
          },
          вакантДолжн: {
            __caption__: '',
            должности: {
              __caption__: 'Вакантная должность'
            }
          }
        },
        иметьПриСебе: {
          __caption__: 'Иметь при себе'
        }
      },
      тЧРегРезульт: {
        __caption__: 'Т ч рег результ',
        итогСобес: {
          __caption__: 'Итог собес'
        },
        оценкаКандид: {
          __caption__: 'Оценка кандид'
        },
        крКомИлиОбсРеш: {
          __caption__: 'Кр ком или обс реш'
        },
        сотрудники: {
          __caption__: 'Сотрудники',
          фИОСотруд: {
            __caption__: 'Ф и о сотруд'
          }
        }
      }
    },
    РегРезультL: {
      датРегРезСобес: {
        __caption__: 'Дата регистрации результатов'
      },
      организация: {
        __caption__: 'Наименование организации',
        наименование: {
          __caption__: 'Наименование организации'
        }
      },
      планирСобес: {
        __caption__: 'ФИО',
        регистАнкеты: {
          __caption__: '',
          фИОКандидата: {
            __caption__: 'ФИО'
          },
          вакантДолжн: {
            __caption__: '',
            должности: {
              __caption__: 'Вакантная должность'
            }
          }
        }
      }
    }
  },
  validations: {
    датРегРезСобес: {
      __caption__: 'Дата регистрации результатов'
    },
    организация: {
      __caption__: 'Наименование организации'
    },
    планирСобес: {
      __caption__: 'ФИО'
    },
    тЧРегРезульт: {
      __caption__: 'Т ч рег результ'
    }
  }
};
